#+TITLE: tasks at work 

* projects
** Market structure report 
*** DONE JIRA issue: UI for date section.
- test driven ? 

*** TODO adding utility to PRMC test tool 




    
* KTLO
** TODO go through team bf/bb queue 
   SCHEDULED: <2016-12-19 Mon .+3d/5d>
   - State "DONE"       from "TODO"       [2016-12-16 Fri 15:16]
   - State "DONE"       from "TODO"       [2016-10-21 Fri 16:48]
   - State "DONE"       from "TODO"       [2016-10-17 Mon 14:44]
   - State "DONE"       from "TODO"       [2016-10-10 Mon 11:53]
   - State "DONE"       from "TODO"       [2016-10-06 Thu 17:53]
   - State "DONE"       from "TODO"       [2016-10-03 Mon 15:28]
   - State "DONE"       from "TODO"       [2016-09-28 Wed 12:10]
   - State "DONE"       from "TODO"       [2016-09-26 Mon 17:29]
   - State "DONE"       from "TODO"       [2016-09-23 Fri 14:55]
   - State "DONE"       from "TODO"       [2016-09-21 Wed 12:32]
   - State "DONE"       from "TODO"       [2016-09-19 Mon 15:21]
   - State "DONE"       from "TODO"       [2016-09-16 Fri 10:59]
   - State "DONE"       from "TODO"       [2016-09-15 Thu 12:26]
   CLOCK: [2016-09-15 Thu 11:54]--[2016-09-15 Thu 12:26] =>  0:32
   - State "DONE"       from "TODO"       [2016-09-13 Tue 12:02]
   - State "DONE"       from "TODO"       [2016-09-12 Mon 14:06]
   CLOCK: [2016-09-12 Mon 13:47]--[2016-09-12 Mon 14:06] =>  0:19
   - State "DONE"       from "TODO"       [2016-09-06 Tue 13:40]
   - State "DONE"       from "TODO"       [2016-09-06 Tue 13:40]
   - State "DONE"       from "TODO"       [2016-09-02 Fri 14:59]
   CLOCK: [2016-09-02 Fri 14:23]--[2016-09-02 Fri 14:59] =>  0:36
   - State "DONE"       from "TODO"       [2016-08-30 Tue 11:42]
   - State "DONE"       from "TODO"       [2016-08-30 Tue 11:42]
   - State "DONE"       from "TODO"       [2016-08-26 Fri 11:13]
   CLOCK: [2016-08-26 Fri 11:03]--[2016-08-26 Fri 11:13] =>  0:10
   - State "DONE"       from "TODO"       [2016-08-25 Thu 14:37]
   CLOCK: [2016-08-25 Thu 14:30]--[2016-08-25 Thu 14:37] =>  0:07
   - State "DONE"       from "TODO"       [2016-08-22 Mon 16:36]
   - State "DONE"       from "TODO"       [2016-08-19 Fri 12:23]
   CLOCK: [2016-08-19 Fri 12:08]--[2016-08-19 Fri 12:23] =>  0:15
   - State "DONE"       from "TODO"       [2016-08-17 Wed 18:04]
   CLOCK: [2016-08-17 Wed 17:40]--[2016-08-17 Wed 18:04] =>  0:24
   :PROPERTIES:
   :LAST_REPEAT: [2016-12-16 Fri 15:16]
   :STYLE:    habit
   :END:      

** TODO spent 1 hour on KTLO 
   SCHEDULED: <2016-10-14 Fri>
   - State "DONE"       from "TODO"       [2016-12-20 Tue 16:47]
   - State "DONE"       from "TODO"       [2016-10-10 Mon 14:52]
   CLOCK: [2016-10-10 Mon 14:01]--[2016-10-10 Mon 14:52] =>  0:51
   - State "DONE"       from "TODO"       [2016-10-06 Thu 17:54]
   - State "DONE"       from "TODO"       [2016-10-04 Tue 12:07]
   - State "DONE"       from "TODO"       [2016-10-03 Mon 15:28]
   - State "DONE"       from "TODO"       [2016-09-26 Mon 14:50]
   - State "DONE"       from "TODO"       [2016-09-23 Fri 14:55]
   - State "DONE"       from "TODO"       [2016-09-19 Mon 15:20]
   - State "DONE"       from "TODO"       [2016-09-16 Fri 17:38]
   - State "DONE"       from "TODO"       [2016-09-14 Wed 14:46]
   CLOCK: [2016-09-14 Wed 14:27]--[2016-09-14 Wed 14:46] =>  0:19
   CLOCK: [2016-09-13 Tue 12:02]--[2016-09-13 Tue 13:15] =>  1:13
   - State "DONE"       from "TODO"       [2016-09-12 Mon 14:22]
   - State "DONE"       from "TODO"       [2016-09-09 Fri 10:46]
   - State "DONE"       from "TODO"       [2016-09-07 Wed 11:14]
   CLOCK: [2016-09-07 Wed 11:14]--[2016-09-07 Wed 11:14] =>  0:00
   - State "DONE"       from "TODO"       [2016-09-06 Tue 13:40]
   - State "DONE"       from "TODO"       [2016-09-02 Fri 15:14]
   - State "DONE"       from "TODO"       [2016-08-31 Wed 13:50]
   - State "DONE"       from "TODO"       [2016-08-30 Tue 17:37]
   - State "DONE"       from "TODO"       [2016-08-26 Fri 13:48]
   - State "DONE"       from "TODO"       [2016-08-25 Thu 15:19]
   - State "DONE"       from "TODO"       [2016-08-24 Wed 18:53]
   - State "DONE"       from "TODO"       [2016-08-23 Tue 16:08]
   CLOCK: [2016-08-23 Tue 14:18]--[2016-08-23 Tue 14:37] =>  0:19
   CLOCK: [2016-08-23 Tue 11:16]--[2016-08-23 Tue 13:05] =>  1:49
   - State "DONE"       from "TODO"       [2016-08-22 Mon 16:14]
   CLOCK: [2016-08-22 Mon 12:51]--[2016-08-22 Mon 16:14] =>  3:23
   CLOCK: [2016-08-22 Mon 11:00]--[2016-08-22 Mon 11:48] =>  0:48
   - State "DONE"       from "TODO"       [2016-08-19 Fri 16:09]
   CLOCK: [2016-08-19 Fri 14:49]--[2016-08-19 Fri 16:09] =>  1:20
   CLOCK: [2016-08-19 Fri 12:39]--[2016-08-19 Fri 13:02] =>  0:23
   - State "DONE"       from "TODO"       [2016-08-18 Thu 11:43]
   CLOCK: [2016-08-18 Thu 10:35]--[2016-08-18 Thu 11:43] =>  1:08
   CLOCK: [2016-08-17 Wed 18:05]--[2016-08-17 Wed 18:20] =>  0:15
   :PROPERTIES:
   :Effort:   1:00
   :LAST_REPEAT: [2016-12-20 Tue 16:47]
   :STYLE:    habit
   :END:
- clock-in this task 
- task to JIRA board



* work productivity 
+ set the goal 
+ use jira to track the daily effort 
+ update the daily effort. this is important since it makes you have a general
understanding of the work 
+ always have something to do 
+ learn something new 



* extra projects. 
- reading books 
- tryout new technology 
- productivity boost 
- online shopping 


* misc  
** read code base 


** better javascript code 

   
** better at emacs 
[[file:scratch.org::*emacs learning]]

** learn refactoring 
file:refactor.org




* Tasks
** DONE the first entry of the work template 
** DONE fix drqses <2016-05-03 Tue 11:57> 
drqs in queue







* retrospect
** TODO [#A] filling out scratch pad 
   SCHEDULED: <2016-12-23 Fri ++1w>
   - State "DONE"       from "TODO"       [2016-12-20 Tue 16:21]
   - State "DONE"       from "TODO"       [2016-10-14 Fri 18:11]
   - State "DONE"       from "TODO"       [2016-10-11 Tue 10:15]
   - State "DONE"       from "TODO"       [2016-10-05 Wed 11:16]
   - State "DONE"       from "TODO"       [2016-10-04 Tue 12:07]
   - State "DONE"       from "TODO"       [2016-09-27 Tue 15:22]
   - State "DONE"       from "TODO"       [2016-09-23 Fri 14:55]
   - State "DONE"       from "TODO"       [2016-09-20 Tue 10:38]
   - State "DONE"       from "TODO"       [2016-09-15 Thu 18:41]
   - State "DONE"       from "TODO"       [2016-09-13 Tue 18:09]
   - State "DONE"       from "TODO"       [2016-09-12 Mon 17:12]
   CLOCK: [2016-09-12 Mon 16:07]--[2016-09-12 Mon 17:12] =>  1:05
   - State "DONE"       from "TODO"       [2016-09-09 Fri 17:56]
   - State "DONE"       from "TODO"       [2016-09-08 Thu 17:22]
   CLOCK: [2016-09-08 Thu 15:57]--[2016-09-08 Thu 17:22] =>  1:25
   - State "DONE"       from "TODO"       [2016-09-06 Tue 13:40]
   - State "DONE"       from "TODO"       [2016-08-31 Wed 11:38]
   - State "DONE"       from "TODO"       [2016-08-26 Fri 17:41]
   - State "DONE"       from "TODO"       [2016-08-25 Thu 18:18]
   - State "DONE"       from "TODO"       [2016-08-23 Tue 18:45]
   - State "DONE"       from "TODO"       [2016-08-23 Tue 18:44]
   - State "DONE"       from "TODO"       [2016-08-17 Wed 17:36]
   CLOCK: [2016-08-17 Wed 16:59]--[2016-08-17 Wed 17:30] =>  0:31
   - State "DONE"       from "TODO"       [2016-08-16 Tue 18:34]
   - State "DONE"       from "TODO"       [2016-08-11 Thu 15:33]
   - State "DONE"       from "TODO"       [2016-08-09 Tue 12:28]
   :PROPERTIES:
   :LAST_REPEAT: [2016-12-20 Tue 16:21]
   :Effort:   0:15
   :END:
